Masmiseim36/nxpSDK/boards/frdmkv11z/demo_apps/mc_pmsm/pmsm_snsless/pin_mux.h
/*
 * Copyright 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTC1 (number 44), J18[14]/J22[A40]/J500[9]/U2[3]/FTM0_CH0/LED0
  @{ */
#define PINTOOL_FTM_LED_GREEN1_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_FTM_LED_GREEN1_PIN 1U     /*!<@brief PORTC pin index: 1 */
                                          /* @} */

/*! @name PORTC2 (number 45), J18[15]/J22[A39]/J24[15]/J500[11]/U2[4]/FTM0_CH1/LED1
  @{ */
#define PINTOOL_FTM_LED_YELLOW1_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_FTM_LED_YELLOW1_PIN 2U     /*!<@brief PORTC pin index: 2 */
                                           /* @} */

/*! @name PORTC3 (number 46), J1[1]/J18[16]/J22[A38]/J24[16]/J500[30]/U2[5]/FTM0_CH2/LED2
  @{ */
#define PINTOOL_FTM_LED_GREEN2_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_FTM_LED_GREEN2_PIN 3U     /*!<@brief PORTC pin index: 3 */
                                          /* @} */

/*! @name PORTC4 (number 49), J22[A37]/J24[17]/J500[32]/U2[6]/FTM0_CH3/LED3
  @{ */
#define PINTOOL_FTM_LED_YELLOW2_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_FTM_LED_YELLOW2_PIN 4U     /*!<@brief PORTC pin index: 4 */
                                           /* @} */

/*! @name PORTD4 (number 61), J22[B40]/J24[25]/J500[34]/U2[7]/FTM0_CH4/LED4
  @{ */
#define PINTOOL_FTM_LED_GREEN3_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_FTM_LED_GREEN3_PIN 4U     /*!<@brief PORTD pin index: 4 */
                                          /* @} */

/*! @name PORTD5 (number 62), J22[B39]/J24[26]/J500[36]/U2[8]/FTM0_CH5/LED5
  @{ */
#define PINTOOL_FTM_LED_YELLOW3_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_FTM_LED_YELLOW3_PIN 5U     /*!<@brief PORTD pin index: 5 */
                                           /* @} */

/*!
 *
 */
void PinTool_FTM(void);

#define SOPT5_UART0RXSRC_UART_RX 0x00u /*!<@brief UART 0 Receive Data Source Select: UART0_RX pin */
#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 Transmit Data Source Select: UART0_TX pin */

/*! @name PORTB16 (number 39), J24[9]/J500[7]/J506[2]/U512[2]/RXD0
  @{ */
#define PINTOOL_UART_DEBUG_UART_RX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define PINTOOL_UART_DEBUG_UART_RX_PIN 16U    /*!<@brief PORTB pin index: 16 */
                                              /* @} */

/*! @name PORTB17 (number 40), J24[10]/J500[5]/J505[2]/U513[4]/TXD0
  @{ */
#define PINTOOL_UART_DEBUG_UART_TX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define PINTOOL_UART_DEBUG_UART_TX_PIN 17U    /*!<@brief PORTB pin index: 17 */
                                              /* @} */

/*!
 *
 */
void PinTool_UART(void);

/*! @name PORTD6 (number 63), J22[B33]/J22[D34]/J24[27]/J500[13]/U2[9]/FTM1_CH0/LED6
  @{ */
#define PINTOOL_MISC_LED_ORANGE_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define PINTOOL_MISC_LED_ORANGE_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_MISC_LED_ORANGE_PIN 6U     /*!<@brief PORTD pin index: 6 */
                                           /* @} */

/*! @name PORTA4 (number 26), J24[7]/J500[14]/SW2
  @{ */
#define PINTOOL_MISC_SW2_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define PINTOOL_MISC_SW2_PORT PORTA /*!<@brief PORT device name: PORTA */
#define PINTOOL_MISC_SW2_PIN 4U     /*!<@brief PORTA pin index: 4 */
                                    /* @} */

/*!
 *
 */
void PinTool_Misc(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
